In [22]:
import pandas as pd 
import numpy as np

In [36]:
df = pd.DataFrame({'A' :[1,2,np.nan,] ,
                   'B' :[5,np.nan,np.nan],
                   'C' :[1,2,3]})

In [38]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [44]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [46]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [69]:
df.fillna(value = 'VALUE')

       A      B  C
0    1.0    5.0  1
1    2.0  VALUE  2
2  VALUE  VALUE  3

In [71]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [73]:
#### group by pandas

In [91]:
data = {'Company' :['GOOG','GOOG','MFST','MFST','FB','FB'],
        'Person' :['sam', 'charrle','Amy','vanessa','Sarah' ,'Nada'],
        'Sales' : [200,120,340,124,350,3440] }

In [93]:
df = pd.DataFrame(data)

In [95]:
df

  Company   Person  Sales
0    GOOG      sam    200
1    GOOG  charrle    120
2    MFST      Amy    340
3    MFST  vanessa    124
4      FB    Sarah    350
5      FB     Nada   3440

In [118]:
bycompany = df.groupby('Company')

In [120]:
mean_sales = bycompany.mean(numeric_only=True)

In [122]:
mean_sales

          Sales
Company
FB       1895.0
GOOG      160.0
MFST      232.0

In [124]:
bycompany.sum()

             Person  Sales
Company
FB        SarahNada   3790
GOOG     samcharrle    320
MFST     Amyvanessa    464

In [128]:
bycompany.std(numeric_only=True)

               Sales
Company
FB       2184.959954
GOOG       56.568542
MFST      152.735065

In [130]:
bycompany.sum().loc['FB']

Person    SarahNada
Sales          3790
Name: FB, dtype: object

In [132]:
df.groupby('Company').sum().loc['FB']

Person    SarahNada
Sales          3790
Name: FB, dtype: object

In [134]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Nada    350
GOOG     charrle    120
MFST         Amy    124

In [136]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah   3440
GOOG         sam    200
MFST     vanessa    340

In [140]:
df.groupby('Company').describe().transpose()

Company               FB        GOOG        MFST
Sales count     2.000000    2.000000    2.000000
      mean   1895.000000  160.000000  232.000000
      std    2184.959954   56.568542  152.735065
      min     350.000000  120.000000  124.000000
      25%    1122.500000  140.000000  178.000000
      50%    1895.000000  160.000000  232.000000
      75%    2667.500000  180.000000  286.000000
      max    3440.000000  200.000000  340.000000